class ChallengesContent {
  static String challenge1 =
      'في هذا التحدي ستقوم بإنشاء تطبيق فلاتر يحتوي على شاشة لتسجيل الدخول وشاشة لجلب بيانات من الإنترنت وعرضها للمستخدم والتي يمكن أيضا للمستخدم من خلالها تسجيل خروجه. ستقوم باستخدام Basic Authentication لتسجيل دخول المستخدم وستقوم بإدارة accessToken الخاصة بالمستخدم أثناء تسجيله الدخول والخروج وأيضا أثناء إرسال أي request لجلب بيانات المستخدم.';

  static String challenge2 =
      'في هذا التحدي ستقوم بإنشاء Form يمكن للمستخدم من خلاله تسليم بيانات مختلفة عن نفسه تتضمن نصوص مدخلة واختيار من متعدد وأيضا ملف PDF وصورة شخصية. ستسخدم طريقتين لرفع الملفات ومن ضمنها استخدام Multipart request. وستقوم بفرض بعض الشروط على الملفات المرفوعة لتطبيق الأمان مثل تحديد صيغ الملفات التي يمكن رفعها وحجم الملف. ';
}
